example/open/system/probes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out values of fields from cells nearest to specified locations.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/probes/probes.cfg"

type            probes;
libs            ("libsampling.so");
writeControl    timeStep;
writeInterval   1;

fields
(
    U
);

probeLocations
(
	//L is the lenght of the TTU model
	// The probes are spaced at every L in streamwise direction.
	//X =0
	(  0.0000   0.0000   0.0100) 
	(  0.0000   0.0000   0.0124) 
	(  0.0000   0.0000   0.0153) 
	(  0.0000   0.0000   0.0190) 
	(  0.0000   0.0000   0.0235) 
	(  0.0000   0.0000   0.0292) 
	(  0.0000   0.0000   0.0361) 
	(  0.0000   0.0000   0.0448) 
	(  0.0000   0.0000   0.0555) 
	(  0.0000   0.0000   0.0687) 
	(  0.0000   0.0000   0.0851) 
	(  0.0000   0.0000   0.1054) 
	(  0.0000   0.0000   0.1306) 
	(  0.0000   0.0000   0.1618) 
	(  0.0000   0.0000   0.2004) 
	(  0.0000   0.0000   0.2482) 
	(  0.0000   0.0000   0.3075) 
	(  0.0000   0.0000   0.3809) 
	(  0.0000   0.0000   0.4719) 
	(  0.0000   0.0000   0.5845) 

	//X =0.27432
	(  0.2743   0.0000   0.0100) 
	(  0.2743   0.0000   0.0124) 
	(  0.2743   0.0000   0.0153) 
	(  0.2743   0.0000   0.0190) 
	(  0.2743   0.0000   0.0235) 
	(  0.2743   0.0000   0.0292) 
	(  0.2743   0.0000   0.0361) 
	(  0.2743   0.0000   0.0448) 
	(  0.2743   0.0000   0.0555) 
	(  0.2743   0.0000   0.0687) 
	(  0.2743   0.0000   0.0851) 
	(  0.2743   0.0000   0.1054) 
	(  0.2743   0.0000   0.1306) 
	(  0.2743   0.0000   0.1618) 
	(  0.2743   0.0000   0.2004) 
	(  0.2743   0.0000   0.2482) 
	(  0.2743   0.0000   0.3075) 
	(  0.2743   0.0000   0.3809) 
	(  0.2743   0.0000   0.4719) 
	(  0.2743   0.0000   0.5845) 

	//X =0.54864
	(  0.5486   0.0000   0.0100) 
	(  0.5486   0.0000   0.0124) 
	(  0.5486   0.0000   0.0153) 
	(  0.5486   0.0000   0.0190) 
	(  0.5486   0.0000   0.0235) 
	(  0.5486   0.0000   0.0292) 
	(  0.5486   0.0000   0.0361) 
	(  0.5486   0.0000   0.0448) 
	(  0.5486   0.0000   0.0555) 
	(  0.5486   0.0000   0.0687) 
	(  0.5486   0.0000   0.0851) 
	(  0.5486   0.0000   0.1054) 
	(  0.5486   0.0000   0.1306) 
	(  0.5486   0.0000   0.1618) 
	(  0.5486   0.0000   0.2004) 
	(  0.5486   0.0000   0.2482) 
	(  0.5486   0.0000   0.3075) 
	(  0.5486   0.0000   0.3809) 
	(  0.5486   0.0000   0.4719) 
	(  0.5486   0.0000   0.5845) 

	//X =0.82296
	(  0.8230   0.0000   0.0100) 
	(  0.8230   0.0000   0.0124) 
	(  0.8230   0.0000   0.0153) 
	(  0.8230   0.0000   0.0190) 
	(  0.8230   0.0000   0.0235) 
	(  0.8230   0.0000   0.0292) 
	(  0.8230   0.0000   0.0361) 
	(  0.8230   0.0000   0.0448) 
	(  0.8230   0.0000   0.0555) 
	(  0.8230   0.0000   0.0687) 
	(  0.8230   0.0000   0.0851) 
	(  0.8230   0.0000   0.1054) 
	(  0.8230   0.0000   0.1306) 
	(  0.8230   0.0000   0.1618) 
	(  0.8230   0.0000   0.2004) 
	(  0.8230   0.0000   0.2482) 
	(  0.8230   0.0000   0.3075) 
	(  0.8230   0.0000   0.3809) 
	(  0.8230   0.0000   0.4719) 
	(  0.8230   0.0000   0.5845) 

	//X =1.0973
	(  1.0973   0.0000   0.0100) 
	(  1.0973   0.0000   0.0124) 
	(  1.0973   0.0000   0.0153) 
	(  1.0973   0.0000   0.0190) 
	(  1.0973   0.0000   0.0235) 
	(  1.0973   0.0000   0.0292) 
	(  1.0973   0.0000   0.0361) 
	(  1.0973   0.0000   0.0448) 
	(  1.0973   0.0000   0.0555) 
	(  1.0973   0.0000   0.0687) 
	(  1.0973   0.0000   0.0851) 
	(  1.0973   0.0000   0.1054) 
	(  1.0973   0.0000   0.1306) 
	(  1.0973   0.0000   0.1618) 
	(  1.0973   0.0000   0.2004) 
	(  1.0973   0.0000   0.2482) 
	(  1.0973   0.0000   0.3075) 
	(  1.0973   0.0000   0.3809) 
	(  1.0973   0.0000   0.4719) 
	(  1.0973   0.0000   0.5845) 

	//X =1.3716
	(  1.3716   0.0000   0.0100) 
	(  1.3716   0.0000   0.0124) 
	(  1.3716   0.0000   0.0153) 
	(  1.3716   0.0000   0.0190) 
	(  1.3716   0.0000   0.0235) 
	(  1.3716   0.0000   0.0292) 
	(  1.3716   0.0000   0.0361) 
	(  1.3716   0.0000   0.0448) 
	(  1.3716   0.0000   0.0555) 
	(  1.3716   0.0000   0.0687) 
	(  1.3716   0.0000   0.0851) 
	(  1.3716   0.0000   0.1054) 
	(  1.3716   0.0000   0.1306) 
	(  1.3716   0.0000   0.1618) 
	(  1.3716   0.0000   0.2004) 
	(  1.3716   0.0000   0.2482) 
	(  1.3716   0.0000   0.3075) 
	(  1.3716   0.0000   0.3809) 
	(  1.3716   0.0000   0.4719) 
	(  1.3716   0.0000   0.5845) 

);

// ************************************************************************* //
